#include <iostream>
#include <iomanip>
#include "GlobalFunc.h"

using namespace std;

void printHeader(){
	cout << endl
		<< setw(3) << "id" << "|"
		<< setw(10) << "Дата" << "|"
		<< setw(6) << "Время" << "|"
		<< setw(12) << "Фамилия" << " "
		<< setw(12) << "Имя" << " "
		<< setw(12) << "Отчество" << "|"
		<< setw(12) << "Телефон" << "|"
		<< setw(12) << "Мастер" << "|"
		<< setw(15) << "Вид услуги" << "|"
		<< setw(4) << "Цена" << endl;
}

void printFooter(){
	cout << setw(3) << "---" << "+"
		<< setw(10) << "----------" << "+"
		<< setw(6) << "------" << "+"
		<< setw(12) << "-------------"
		<< setw(12) << "-------------"
		<< setw(12) << "------------" << "+"
		<< setw(12) << "------------" << "+"
		<< setw(12) << "------------" << "+"
		<< setw(15) << "---------------" << "+"
		<< setw(4) << "----";
}